<a href="https://colab.research.google.com/github/tomaszkordiak/data-science-bootcamp/blob/main/Pandas1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [35]:
import pandas as pd

In [36]:
titanic = pd.read_csv('titanic.csv')

In [37]:
mask1 = titanic.sex == 'female'
mask1.head()

0    False
1     True
2     True
3     True
4    False
Name: sex, dtype: bool

In [38]:
mask2 = titanic.age < 14
mask2.head()

0    False
1    False
2    False
3    False
4    False
Name: age, dtype: bool

In [39]:
t2 = titanic.loc[mask1 | mask2, ['survived', 'sex', 'age', 'fare']]
t2.describe()

         survived         age        fare
count  351.000000  298.000000  351.000000
mean     0.723647   25.039161   43.441786
std      0.447832   15.314631   55.676194
min      0.000000    0.420000    6.750000
25%      0.000000   14.125000   12.475000
50%      1.000000   24.000000   24.150000
75%      1.000000   35.000000   51.931250
max      1.000000   63.000000  512.329200

In [31]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]